#pragma once

// Name: S, Version: N


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class ConZ.AchievementsManagerClient
// 0x0098 (FullSize[0x02B8] - InheritedSize[0x0220])
class AAchievementsManagerClient : public AActor
{
public:
	unsigned char                                      UnknownData_ZWGT[0x98];                                    // 0x0220(0x0098) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AchievementsManagerClient"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AchievementsManagerServer
// 0x0078 (FullSize[0x0298] - InheritedSize[0x0220])
class AAchievementsManagerServer : public AActor
{
public:
	unsigned char                                      UnknownData_N69D[0x78];                                    // 0x0220(0x0078) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AchievementsManagerServer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.DesignableUserWidget
// 0x0018 (FullSize[0x0278] - InheritedSize[0x0260])
class UDesignableUserWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData_UTIA[0x18];                                    // 0x0260(0x0018) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.DesignableUserWidget"));
		return ptr;
	}



	void SetDisplayLabelName(const struct FString& displayLabelName);
	void SetDefaultPosition(const struct FVector2D& Value);
	void OnSynchronizeProperties();
	struct FString GetDisplayLabelName();
	struct FVector2D GetDefaultPosition();
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.ActionProgressWidget
// 0x0050 (FullSize[0x02C8] - InheritedSize[0x0278])
class UActionProgressWidget : public UDesignableUserWidget
{
public:
	struct FScriptMulticastDelegate                    ActionProgressFinishedEvent;                               // 0x0278(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    ActionProgressCancelledEvent;                              // 0x0288(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                               CanCancel;                                                 // 0x0298(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0Z1X[0xB];                                     // 0x0299(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _currentTime;                                              // 0x02A4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _duration;                                                 // 0x02A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               _manualMode;                                               // 0x02AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_RT2F[0x1B];                                    // 0x02AD(0x001B) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.ActionProgressWidget"));
		return ptr;
	}



	void UnPauseProgress();
	void SetProgress(float progress);
	void PauseProgress();
	void OnActionProgressFinishedEvent__DelegateSignature();
	void OnActionProgressCancelledEvent__DelegateSignature();
	void ExecuteAction();
	void CancelAction();
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.ActorStatics
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UActorStatics : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.ActorStatics"));
		return ptr;
	}



	class UActorComponent* GetActorComponentByName(class AActor* Actor, const struct FName& Name);
	struct FVector GetActorBoundsCenter(class AActor* Actor, bool onlyCollidingComponents);
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.Sickness
// 0x0188 (FullSize[0x01B0] - InheritedSize[0x0028])
class USickness : public UObject
{
public:
	unsigned char                                      UnknownData_52QU[0x188];                                   // 0x0028(0x0188) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.Sickness"));
		return ptr;
	}



	void SetShouldDisplayState(bool Value);
	ConZ_ESicknessState GetState();
	bool GetShouldDisplayState();
	int GetPhase();
	struct FText GetCaption();
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.Addiction
// 0x0000 (FullSize[0x01B0] - InheritedSize[0x01B0])
class UAddiction : public USickness
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.Addiction"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand
// 0x0058 (FullSize[0x0080] - InheritedSize[0x0028])
class UAdminCommand : public UObject
{
public:
	struct FString                                     _verb;                                                     // 0x0028(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAdminCommandArgumentDescription>    _argumentDescriptions;                                     // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	int                                                _numberOfRequiredArguments;                                // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _isEnabled;                                                // 0x004C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _isEnabledInShippingBuild;                                 // 0x004D(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _isAdminStatusRequired;                                    // 0x004E(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _isDeveloperStatusRequired;                                // 0x004F(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _shouldExecuteOnServer;                                    // 0x0050(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _shouldExecuteOnClient;                                    // 0x0051(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _shouldDisableSingleplayerAchievementsIfExecuted;          // 0x0052(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_GVJW[0x5];                                     // 0x0053(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     _description;                                              // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_88YO[0x18];                                    // 0x0068(0x0018) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand"));
		return ptr;
	}



	bool Execute(TArray<struct FString> arguments);
	bool CanEverBeExecuted(class APlayerController* Controller, struct FString* reasonIfNot);
	bool CanBeExecuted(class APlayerController* Controller, struct FString* reasonIfNot);
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_AddOrRemoveWidget
// 0x0050 (FullSize[0x00D0] - InheritedSize[0x0080])
class UAdminCommand_AddOrRemoveWidget : public UAdminCommand
{
public:
	TMap<struct FName, class UClass*>                  _widgetClassesByName;                                      // 0x0080(0x0050) (Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_AddOrRemoveWidget"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_AddPrisonerBodyEffect
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_AddPrisonerBodyEffect : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_AddPrisonerBodyEffect"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_AdminLight
// 0x0010 (FullSize[0x0090] - InheritedSize[0x0080])
class UAdminCommand_AdminLight : public UAdminCommand
{
public:
	class UClass*                                      _adminLightComponent;                                      // 0x0080(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              _maxIntensityMultiplier;                                   // 0x0088(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_RBVL[0x4];                                     // 0x008C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_AdminLight"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Announce
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Announce : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Announce"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_BanPlayer
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_BanPlayer : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_BanPlayer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_CancelVote
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_CancelVote : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_CancelVote"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_CharacterSpawner
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_CharacterSpawner : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_CharacterSpawner"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ClearFakeName
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ClearFakeName : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ClearFakeName"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_CompleteMission
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_CompleteMission : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_CompleteMission"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ComputeBodyComposition
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ComputeBodyComposition : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ComputeBodyComposition"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_CrashMajestically
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_CrashMajestically : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_CrashMajestically"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_DemolitionSkillDebug
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_DemolitionSkillDebug : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_DemolitionSkillDebug"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_DestroyAllVehicles
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_DestroyAllVehicles : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_DestroyAllVehicles"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_DestroyVehicle
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_DestroyVehicle : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_DestroyVehicle"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_DistanceDebug
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_DistanceDebug : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_DistanceDebug"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_DoorDebug
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_DoorDebug : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_DoorDebug"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_DumpAllSquadsInfoList
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_DumpAllSquadsInfoList : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_DumpAllSquadsInfoList"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_EndTournamentMode
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_EndTournamentMode : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_EndTournamentMode"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ExecuteConsoleCommand
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ExecuteConsoleCommand : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ExecuteConsoleCommand"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_FindSquadMember
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_FindSquadMember : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_FindSquadMember"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Immortality
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Immortality : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Immortality"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_KickPlayer
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_KickPlayer : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_KickPlayer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Knockout
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Knockout : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Knockout"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_LeaveCorpse
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_LeaveCorpse : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_LeaveCorpse"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListMutedPlayers
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ListMutedPlayers : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListMutedPlayers"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListPlayers
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ListPlayers : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListPlayers"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListPrimaryAssets
// 0x0058 (FullSize[0x00D8] - InheritedSize[0x0080])
class UAdminCommand_ListPrimaryAssets : public UAdminCommand
{
public:
	struct FPrimaryAssetType                           _primaryAssetType;                                         // 0x0080(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      _primaryAssetsToExclude[0x50];                             // 0x0088(0x0050) UNKNOWN PROPERTY: SetProperty


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListPrimaryAssets"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListSilencedPlayers
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ListSilencedPlayers : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListSilencedPlayers"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListSpawnedAnimals
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ListSpawnedAnimals : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListSpawnedAnimals"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListSpawnedVehicles
// 0x00E0 (FullSize[0x0160] - InheritedSize[0x0080])
class UAdminCommand_ListSpawnedVehicles : public UAdminCommand
{
public:
	struct FGameplayTagContainer                       _vehicleSpawnGroupsByCategory[0x7];                        // 0x0080(0x00E0) (Edit, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListSpawnedVehicles"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListSquadMembers
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ListSquadMembers : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListSquadMembers"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ListSquads
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ListSquads : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ListSquads"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Location
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Location : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Location"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_LogCharacterSpawner
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_LogCharacterSpawner : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_LogCharacterSpawner"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Loot
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Loot : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Loot"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_MutePlayer
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_MutePlayer : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_MutePlayer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_PlaceableActorDebug
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_PlaceableActorDebug : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_PlaceableActorDebug"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_PrisonerTakeDamage
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_PrisonerTakeDamage : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_PrisonerTakeDamage"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ReloadCustomMapConfig
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ReloadCustomMapConfig : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ReloadCustomMapConfig"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ReloadVoteConfig
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ReloadVoteConfig : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ReloadVoteConfig"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_RenameVehicle
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_RenameVehicle : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_RenameVehicle"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ResetAchievements
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ResetAchievements : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ResetAchievements"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ResetMissionEnabled
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ResetMissionEnabled : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ResetMissionEnabled"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ResetSquadInfo
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ResetSquadInfo : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ResetSquadInfo"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ScheduleWorldEvent
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ScheduleWorldEvent : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ScheduleWorldEvent"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SendNotification
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SendNotification : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SendNotification"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetDecayTimeDilation
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetDecayTimeDilation : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetDecayTimeDilation"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetFacialHairLength
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetFacialHairLength : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetFacialHairLength"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetFakeName
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetFakeName : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetFakeName"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetFamePoints
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetFamePoints : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetFamePoints"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetFamePointsToAll
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetFamePointsToAll : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetFamePointsToAll"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetFamePointsToAllOnline
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetFamePointsToAllOnline : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetFamePointsToAllOnline"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetGodMode
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetGodMode : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetGodMode"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetHairLength
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetHairLength : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetHairLength"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetHealthToItemInHands
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetHealthToItemInHands : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetHealthToItemInHands"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetInfiniteAmmo
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetInfiniteAmmo : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetInfiniteAmmo"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetInfiniteStamina
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetInfiniteStamina : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetInfiniteStamina"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetMalfunctionProbability
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetMalfunctionProbability : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetMalfunctionProbability"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetMountedVehicleProperty
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetMountedVehicleProperty : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetMountedVehicleProperty"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetPrisonerProperty
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetPrisonerProperty : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetPrisonerProperty"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetSkillLevel
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetSkillLevel : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetSkillLevel"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetStamina
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetStamina : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetStamina"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetTime
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetTime : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetTime"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SetWeather
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SetWeather : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SetWeather"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ShouldChainTeleportToVehicles
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ShouldChainTeleportToVehicles : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ShouldChainTeleportToVehicles"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ShouldShowOtherPlayerInfo
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ShouldShowOtherPlayerInfo : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ShouldShowOtherPlayerInfo"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ShouldShowOtherPlayerLocations
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ShouldShowOtherPlayerLocations : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ShouldShowOtherPlayerLocations"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ShowBaseBuildingDebug
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ShowBaseBuildingDebug : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ShowBaseBuildingDebug"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_ShowWeaponInfo
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_ShowWeaponInfo : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_ShowWeaponInfo"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SilencePlayer
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_SilencePlayer : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SilencePlayer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Sleep
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Sleep : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Sleep"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SpawnPrimaryActorAsset
// 0x0070 (FullSize[0x00F0] - InheritedSize[0x0080])
class UAdminCommand_SpawnPrimaryActorAsset : public UAdminCommand
{
public:
	struct FPrimaryAssetType                           _primaryAssetType;                                         // 0x0080(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      _primaryAssetsToExclude[0x50];                             // 0x0088(0x0050) UNKNOWN PROPERTY: SetProperty
	int                                                _countArgumentMinValue;                                    // 0x00D8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                _countArgumentMaxValue;                                    // 0x00DC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     _spawnOffset;                                              // 0x00E0(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_757P[0x4];                                     // 0x00EC(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SpawnPrimaryActorAsset"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SpawnItem
// 0x0010 (FullSize[0x0100] - InheritedSize[0x00F0])
class UAdminCommand_SpawnItem : public UAdminCommand_SpawnPrimaryActorAsset
{
public:
	unsigned char                                      UnknownData_IHDB[0x10];                                    // 0x00F0(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SpawnItem"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SpawnRandomPrimaryActorAsset
// 0x0000 (FullSize[0x00F0] - InheritedSize[0x00F0])
class UAdminCommand_SpawnRandomPrimaryActorAsset : public UAdminCommand_SpawnPrimaryActorAsset
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SpawnRandomPrimaryActorAsset"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_SpawnVehicle
// 0x0000 (FullSize[0x00F0] - InheritedSize[0x00F0])
class UAdminCommand_SpawnVehicle : public UAdminCommand_SpawnPrimaryActorAsset
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_SpawnVehicle"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_StartTournamentMode
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_StartTournamentMode : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_StartTournamentMode"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Teleport
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Teleport : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Teleport"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_TeleportTo
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_TeleportTo : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_TeleportTo"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_TeleportTo3pm
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_TeleportTo3pm : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_TeleportTo3pm"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_TeleportToMe
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_TeleportToMe : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_TeleportToMe"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_TeleportToVehicle
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_TeleportToVehicle : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_TeleportToVehicle"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_TrackShotsFired
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_TrackShotsFired : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_TrackShotsFired"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_TrapsDebug
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_TrapsDebug : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_TrapsDebug"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_UnbanPlayer
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_UnbanPlayer : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_UnbanPlayer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_UnmutePlayer
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_UnmutePlayer : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_UnmutePlayer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_UnsilencePlayer
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_UnsilencePlayer : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_UnsilencePlayer"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_VisualizeBulletTrajectories
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_VisualizeBulletTrajectories : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_VisualizeBulletTrajectories"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_VisualizePlayerAiming
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_VisualizePlayerAiming : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_VisualizePlayerAiming"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_VisualizeZombieLocation
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_VisualizeZombieLocation : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_VisualizeZombieLocation"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommand_Vote
// 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
class UAdminCommand_Vote : public UAdminCommand
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommand_Vote"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion
// 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
class UAdminCommandArgumentCompletion : public UObject
{
public:
	bool                                               _canCompletionValuesBeCached;                              // 0x0028(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_EOBJ[0x7];                                     // 0x0029(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion"));
		return ptr;
	}



	void GetCompletionValues(TArray<struct FString>* Result);
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion_Constant
// 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
class UAdminCommandArgumentCompletion_Constant : public UAdminCommandArgumentCompletion
{
public:
	TArray<struct FString>                             _completionValues;                                         // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion_Constant"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion_Enum
// 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
class UAdminCommandArgumentCompletion_Enum : public UAdminCommandArgumentCompletion
{
public:
	struct FName                                       _enum;                                                     // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _excludeNoneEnumerator;                                    // 0x0038(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _excludeCountEnumerator;                                   // 0x0039(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _excludeAutoGeneratedEnumerator;                           // 0x003A(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_V3C4[0x5];                                     // 0x003B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      _additionalEnumeratorsToExclude[0x50];                     // 0x003B(0x0050) UNKNOWN PROPERTY: SetProperty


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion_Enum"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion_Player
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UAdminCommandArgumentCompletion_Player : public UAdminCommandArgumentCompletion
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion_Player"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion_PrimaryAsset
// 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
class UAdminCommandArgumentCompletion_PrimaryAsset : public UAdminCommandArgumentCompletion
{
public:
	struct FPrimaryAssetType                           _primaryAssetType;                                         // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      _primaryAssetsToExclude[0x50];                             // 0x0038(0x0050) UNKNOWN PROPERTY: SetProperty


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion_PrimaryAsset"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion_Skill
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UAdminCommandArgumentCompletion_Skill : public UAdminCommandArgumentCompletion
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion_Skill"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion_Squad
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UAdminCommandArgumentCompletion_Squad : public UAdminCommandArgumentCompletion
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion_Squad"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandArgumentCompletion_Widget
// 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
class UAdminCommandArgumentCompletion_Widget : public UAdminCommandArgumentCompletion
{
public:
	class UClass*                                      _commandClass;                                             // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandArgumentCompletion_Widget"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandCompletionManager
// 0x00B0 (FullSize[0x00D8] - InheritedSize[0x0028])
class UAdminCommandCompletionManager : public UObject
{
public:
	TMap<struct FString, class UClass*>                _commands;                                                 // 0x0028(0x0050) (UObjectWrapper, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_9INI[0x60];                                    // 0x0078(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandCompletionManager"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandRegistry
// 0x0060 (FullSize[0x0088] - InheritedSize[0x0028])
class UAdminCommandRegistry : public UObject
{
public:
	TArray<class UClass*>                              _commands;                                                 // 0x0028(0x0010) (ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_ORGD[0x50];                                    // 0x0038(0x0050) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandRegistry"));
		return ptr;
	}



	bool UnregisterCommand(class UClass* Command);
	void UnregisterAllCommands();
	bool RegisterCommand(class UClass* Command);
	bool IsCommandRegistered(class UClass* Command);
	TArray<class UClass*> GetCommands();
	class UClass* GetCommandByVerb(const struct FString& verb);
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminCommandsStatics
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UAdminCommandsStatics : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminCommandsStatics"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AdminLight
// 0x0014 (FullSize[0x0370] - InheritedSize[0x035C])
class UAdminLight : public UPointLightComponent
{
public:
	unsigned char                                      UnknownData_UT99[0x4];                                     // 0x035C(0x0004) Fix Super Size
	class UCurveFloat*                                 _intensityVersusTimeOfDay;                                 // 0x0360(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_OA3D[0x8];                                     // 0x0368(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AdminLight"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AIDetectionTimerHandler
// 0x0050 (FullSize[0x0270] - InheritedSize[0x0220])
class AAIDetectionTimerHandler : public AActor
{
public:
	unsigned char                                      UnknownData_0AP4[0x50];                                    // 0x0220(0x0050) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AIDetectionTimerHandler"));
		return ptr;
	}



	void OnDestroyedEvent(class AActor* DestroyedActor);
	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AIStatics
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UAIStatics : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AIStatics"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AlcoholismAddiction
// 0x0010 (FullSize[0x01C0] - InheritedSize[0x01B0])
class UAlcoholismAddiction : public UAddiction
{
public:
	unsigned char                                      UnknownData_XIYS[0x10];                                    // 0x01B0(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AlcoholismAddiction"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.Disease
// 0x0000 (FullSize[0x01B0] - InheritedSize[0x01B0])
class UDisease : public USickness
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.Disease"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.Poisoning
// 0x0000 (FullSize[0x01B0] - InheritedSize[0x01B0])
class UPoisoning : public UDisease
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.Poisoning"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AmanitaMuscariaPoisoning
// 0x0010 (FullSize[0x01C0] - InheritedSize[0x01B0])
class UAmanitaMuscariaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData_C98C[0x10];                                    // 0x01B0(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AmanitaMuscariaPoisoning"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AmanitaPantheriaPoisoning
// 0x0008 (FullSize[0x01B8] - InheritedSize[0x01B0])
class UAmanitaPantheriaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData_XFOB[0x8];                                     // 0x01B0(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AmanitaPantheriaPoisoning"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AmanitaPhalloidesPoisoning
// 0x0008 (FullSize[0x01B8] - InheritedSize[0x01B0])
class UAmanitaPhalloidesPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData_FLY1[0x8];                                     // 0x01B0(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AmanitaPhalloidesPoisoning"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AmanitaVirosaPoisoning
// 0x0010 (FullSize[0x01C0] - InheritedSize[0x01B0])
class UAmanitaVirosaPoisoning : public UPoisoning
{
public:
	unsigned char                                      UnknownData_QDSD[0x10];                                    // 0x01B0(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass(_xor_("Class ConZ.AmanitaVirosaPoisoning"));
		return ptr;
	}



	void AfterRead();
	void BeforeDelete();

};

// Class ConZ.AmbientSounds
// 0x0100 (FullSize[0x0320] - InheritedSize[0x0220])
class AAmbientSounds : public AActor
{
public:
	float                                              MinCameraLocationDeltaForUpdate;                           // 0x0220(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                                ForestMask;                                                // 0x0224(0x0008) (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ForestMaskSearchRadius;                                    // 0x022C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     ForestMaskTopLeftWorld;                                    // 0x0230(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     ForestMaskBottomRightWorld;                                // 0x023C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               CoastalForestAudioEvent;                                   // 0x0248(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               ContinentalForest1AudioEvent;                              // 0x0250(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               ContinentalForest2AudioEvent;                              // 0x0258(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               ContinentalForest3AudioEvent;                              // 0x0260(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               UndergroundAudioEvent;                                     // 0x0268(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
